'''
Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
Примеры
список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1
'''
lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
def second(lst, num):
    return[i for i, element in enumerate(lst) if num in element ][1] if len(lst)>=2 else 0
print(second(lst, 'qwe'))
